# WHAT IS PANDAS

Pandas is a Python library for working with structured data. Think tables. Like Excel sheets. Like SQL tables. But inside Python, and way more flexible.

In [1]:
import pandas as pd

In [14]:
data = {
    'name': ['utibe', 'bassey','inyang', 'godwin'],
    'age': [30, 20, 45, 50],
    'location': ['lagos', 'uyo', 'abuja', 'rivers']
}

df = pd.DataFrame(data)
df

display(data)

{'name': ['utibe', 'bassey', 'inyang', 'godwin'],
 'age': [30, 20, 45, 50],
 'location': ['lagos', 'uyo', 'abuja', 'rivers']}

DataFrame, is a full table. Rows and columns. This is what you will live in 90% of the time.

In [15]:
df.head()

     name  age location
0   utibe   30    lagos
1  bassey   20      uyo
2  inyang   45    abuja
3  godwin   50   rivers

In [16]:
df.tail()

     name  age location
0   utibe   30    lagos
1  bassey   20      uyo
2  inyang   45    abuja
3  godwin   50   rivers

In [17]:
df.shape

(4, 3)

In [18]:
df.columns

Index(['name', 'age', 'location'], dtype='object')

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      4 non-null      object
 1   age       4 non-null      int64
 2   location  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

- df.head() - shows the first few rows
- df.shape() - tells your rows and column
- df.info() - tells you the real story: data types, missing values, memory. etc.

Because everything you’ll ever do… cleaning, analyzing, visualizing, modeling… starts with pulling out the right piece of the table.

So. You’re looking at df

In Pandas, Rows have "index" and Columns have "labels".

# Talking to Columns

To get a single column, call the individual column name inside a square bracket;

e.g: df['name']

This returns a Series. One column. With an index.

In [8]:
# Get the 'age' column
df['age']

0    30
1    20
2    45
3    50
Name: age, dtype: int64

In [9]:
# Get the name column
df['name']

0     utibe
1    bassey
2    inyang
3    godwin
Name: name, dtype: object

In [10]:
# Get the location column
df['location']

0     lagos
1       uyo
2     abuja
3    rivers
Name: location, dtype: object

You can also use the dot notation to access column values;

df.name - for instance

In [11]:
# Get the name column using dot notation
df.name

0     utibe
1    bassey
2    inyang
3    godwin
Name: name, dtype: object

In [12]:
# Get multiple columns: name and location
df[['name', 'location']]

     name location
0   utibe    lagos
1  bassey      uyo
2  inyang    abuja
3  godwin   rivers

Notice the brackets
- one bracket = series
- two brackets = DataFrame